## Data preprocessing

In [2]:
import pandas as pd
import numpy as np
import os
import glob
import re

### See surface temperature

In [19]:
def data_transform_month(num):
    # converts raw data into year-month-day 
    num = str(num)
    month = num[5:7]
    
    if month[1] == '-':
        new_date = num[0:5] + '0' + num[5:]
    else:
        new_date = num
    return new_date

In [16]:
def data_transform(num):
    # converts raw data into year-month-day 
    reference = [(.0, 1), (.08, 2), (.17,3), (.25,4), (.33,5), (.42,6), (.5,7), (.58,8), (.67,9), (.75, 10), (.83,11), (.92,12)]
    
    rest = round(num - int(num), 2)
    for i in range(len(reference)):
        if rest == reference[i][0]:
            date = str(int(num)) + '-' + str(reference[i][1]) + '-01' 
            return date

In [42]:
file_name = 'Elninho/Ninho 4 (From NOAA-CPC) Jan-Dec-1948-2021.csv'
df = pd.read_csv(file_name, index_col=None)
df.head()

  Year-month   Temperature
0  1998-1-01         28.95
1  1998-2-01         28.79
2  1998-3-01         28.62
3  1998-4-01         28.56
4  1998-5-01         28.66

In [43]:
df['Year-month'] = list(map(data_transform_month, df['Year-month']))
df

     Year-month   Temperature
0    1998-01-01         28.95
1    1998-02-01         28.79
2    1998-03-01         28.62
3    1998-04-01         28.56
4    1998-05-01         28.66
..          ...           ...
283  2021-08-01         28.53
284  2021-09-01         28.23
285  2021-10-01         28.03
286  2021-11-01           NaN
287  2021-12-01           NaN

[288 rows x 2 columns]

In [44]:
df.to_csv(file_name, index=False)

In [27]:
# Converting all the data to standard data format yyy-mm-dd

In [28]:
df_NTA.fillna('NaN')

     Year-month   NTA
0     1998-1-01  0.47
1     1998-2-01  0.58
2     1998-3-01  0.67
3     1998-4-01  0.56
4     1998-5-01  0.48
..          ...   ...
283   2021-8-01   NaN
284   2021-9-01   NaN
285  2021-10-01   NaN
286  2021-11-01   NaN
287  2021-12-01   NaN

[288 rows x 2 columns]

In [30]:
df_NTA.isna().sum()

Year-month     0
NTA           22
dtype: int64

In [31]:
df_NTA.to_csv('North Tropical Atlantic SST Index (NTA) (From NOAA and PSL) Jan-Dec-1950-2020.csv', index=False)

In [53]:
del df_NTA

### Doing fo all the DataSets

In [33]:
df_TNA = pd.read_csv('TNA (From AOML and PSL) Jan-Dec-1948-2021.csv')
df_TNA.head()

    Year-month   TNA
0  1998.000000  0.43
1  1998.083333  0.77
2  1998.166667  0.75
3  1998.250000  0.59
4  1998.333333  0.59

In [34]:
df_TNA['Year-month'] = list(map(data_transform, df_TNA['Year-month']))
df_TNA.head()

  Year-month   TNA
0  1998-1-01  0.43
1  1998-2-01  0.77
2  1998-3-01  0.75
3  1998-4-01  0.59
4  1998-5-01  0.59

In [51]:
df_TNA_NaN = df_TNA.isnull()
df_TNA_has_NaN_bool = df_TNA_NaN.any(axis=1)
df_TNA_NaN_rows = df_TNA[df_TNA_has_NaN_bool]
df_TNA_NaN_rows

     Year-month  TNA
286  2021-11-01  NaN
287  2021-12-01  NaN

In [54]:
df_TNA.to_csv('TNA (From AOML and PSL) Jan-Dec-1948-2021.csv', index=False)

In [55]:
del df_TNA, df_TNA_has_NaN_bool, df_TNA_NaN_rows, df_TNA_NaN

In [56]:
df_TSA = pd.read_csv('TSA (From AOML and PSL) Jan-Dec-1948-2021.csv')
df_TSA.head()

    Year-month  TSA
0  1998.000000  0.72
1  1998.083333  0.74
2  1998.166667  0.69
3  1998.250000  0.54
4  1998.333333  0.54

In [57]:
df_TSA['Year-month'] = list(map(data_transform, df_TSA['Year-month']))
df_TSA.head()

  Year-month  TSA
0  1998-1-01  0.72
1  1998-2-01  0.74
2  1998-3-01  0.69
3  1998-4-01  0.54
4  1998-5-01  0.54

In [59]:
df_TSA_NaN = df_TSA.isna()
df_TSA_has_NaN_bool = df_TSA_NaN.any(axis=1)
df_TSA_NaN_rows = df_TSA[df_TSA_has_NaN_bool]
df_TSA_NaN_rows

     Year-month  TSA
286  2021-11-01   NaN
287  2021-12-01   NaN

In [60]:
df_TSA.to_csv('TSA (From AOML and PSL) Jan-Dec-1948-2021.csv', index=False)

In [61]:
del df_TSA_NaN, df_TSA_has_NaN_bool, df_TSA_NaN_rows, df_TSA

In [64]:
###
# Para o El Ninho 1+2 
df_N12 = pd.read_csv('Elninho/Ninho 1+2 (From NOAA-CPC) Jan-Dec-1948-2021.csv')
df_N12.head()

    Year-month   Temperature
0  1998.000000         28.12
1  1998.083333         28.74
2  1998.166667         29.23
3  1998.250000         28.22
4  1998.333333         27.14

In [65]:
df_N12['Year-month'] = list(map(data_transform, df_N12['Year-month']))
df_N12.head()

  Year-month   Temperature
0  1998-1-01         28.12
1  1998-2-01         28.74
2  1998-3-01         29.23
3  1998-4-01         28.22
4  1998-5-01         27.14

In [66]:
df_N12.to_csv('Elninho/Ninho 1+2 (From NOAA-CPC) Jan-Dec-1948-2021.csv', index=False)

In [67]:
del df_N12

In [68]:
###
# Para o El Ninho 1+2 
df_N34 = pd.read_csv('Elninho/Ninho 3.4 (From NOAA-CPC) Jan-Dec-1948-2021.csv')
df_N34.head()

df_N34['Year-month'] = list(map(data_transform, df_N34['Year-month']))
df_N34.head()

df_N34.to_csv('Elninho/Ninho 3.4 (From NOAA-CPC) Jan-Dec-1948-2021.csv', index=False)

In [69]:
del df_N34

In [74]:
###
# Para o El Ninho 1+2 
df_N3 = pd.read_csv('Elninho/Ninho 3 (From NOAA-CPC) Jan-Dec-1948-2021.csv')
df_N3.head()

    Year-month   Temperature
0  1998.000000         28.74
1  1998.083333         28.90
2  1998.166667         29.12
3  1998.250000         29.22
4  1998.333333         28.64

In [76]:
del df_N3

In [79]:
###
# Para o El Ninho 1+2 
df_N4 = pd.read_csv('Elninho/Ninho 4 (From NOAA-CPC) Jan-Dec-1948-2021.csv')
df_N4.head()

    Year-month   Temperature
0  1998.000000         28.95
1  1998.083333         28.79
2  1998.166667         28.62
3  1998.250000         28.56
4  1998.333333         28.66

In [80]:

df_N4['Year-month'] = list(map(data_transform, df_N4['Year-month']))
df_N4.head()

df_N4.to_csv('Elninho/Ninho 4 (From NOAA-CPC) Jan-Dec-1948-2021.csv', index=False)

In [88]:
def correcting_date(date):
    #day-month-tear ti year-month-day:
    
    # Catching parts of date:
    dates = re.findall("\d+", date)
    
    corrected = dates[2]+"-"+dates[1]+"-"+dates[0]
    
    return corrected

In [89]:
correcting_date("20/05/2002")

'2002-05-20'

In [90]:
###
# Para o HistÃ³rico Castanhal 
df_Cast = pd.read_csv('NÃ­veis do ReservatÃ³rio/HistÃ³rico_CASTANHÃƒO.csv')
df_Cast.head()

  Data da MediÃ§Ã£o Cota (m) Volume Ãštil (hmÂ³) Volume (%)
0      25/01/2002        0            451,28       6,74
1      30/04/2002        0            451,28       6,74
2      06/05/2002     74,2             420,4       6,27
3      20/05/2002    74,92            451,29       6,74
4      30/05/2002        0             456,6       6,81

In [91]:

df_Cast['Data da MediÃ§Ã£o'] = list(map(correcting_date, df_Cast['Data da MediÃ§Ã£o']))
df_Cast.head()

  Data da MediÃ§Ã£o Cota (m) Volume Ãštil (hmÂ³) Volume (%)
0      2002-01-25        0            451,28       6,74
1      2002-04-30        0            451,28       6,74
2      2002-05-06     74,2             420,4       6,27
3      2002-05-20    74,92            451,29       6,74
4      2002-05-30        0             456,6       6,81

In [137]:
df_corr = df_Cast.copy()

In [154]:
def change_colon(num):
    if ',' in str(num):
        parts = num.split(',')
        new_num = float(parts[0]+"."+parts[1])
    else:
        new_num = float(num)
    return new_num

In [156]:
df_corr['Cota (m)'] = list(map(change_colon, df_corr['Cota (m)']))
df_corr['Volume Ãštil (hmÂ³)'] = list(map(change_colon, df_corr['Volume Ãštil (hmÂ³)']))
df_corr['Volume (%)'] = list(map(change_colon, df_corr['Volume (%)']))

df_corr.head()

  Data da MediÃ§Ã£o  Cota (m)  Volume Ãštil (hmÂ³)  Volume (%)
0      2002-01-25      0.00             451.28        6.74
1      2002-04-30      0.00             451.28        6.74
2      2002-05-06     74.20             420.40        6.27
3      2002-05-20     74.92             451.29        6.74
4      2002-05-30      0.00             456.60        6.81

In [157]:
df_corr.iloc[0]['Data da MediÃ§Ã£o']

'2002-01-25'

In [139]:
df_res = pd.DataFrame({'Data da MediÃ§Ã£o':[], 'Cota (m)':[],
                       'Volume Ãštil (hmÂ³)':[],'Volume (%)':[]})

In [140]:
df_res.append({'Data da MediÃ§Ã£o':0, 'Cota (m)':1,
                       'Volume Ãštil (hmÂ³)':2,'Volume (%)':3}, ignore_index=True)

   Data da MediÃ§Ã£o  Cota (m)  Volume Ãštil (hmÂ³)  Volume (%)
0              0.0       1.0                2.0         3.0

In [164]:
actual_month = 0
sum_cota = 0
sum_volU = 0
sum_vol = 0
counter = 0
for i in range(len(df_corr)):
    i += 1
    print(i)
    data = df_corr.iloc[i]['Data da MediÃ§Ã£o']
    month = data[5:7]
    
    if month == actual_month or i==1:
        print("MÃªs ",month)
        # summing  values for the same month 
        sum_cota += float(df_corr.iloc[i]['Cota (m)'])
        sum_volU += float(df_corr.iloc[i]['Volume Ãštil (hmÂ³)'])
        sum_vol += float(df_corr.iloc[i]['Volume (%)'])
        counter += 1
        actual_month = month
    
    elif not month == actual_month and not counter == 0: 
        # Firstly calculates the month averages
        avg_cota = sum_cota/counter 
        avg_volU = sum_volU/counter
        avg_vol = sum_vol/counter
        
        # Then, append this averaged line in the df_res
        df_res = df_res.append({'Data da MediÃ§Ã£o':data, 'Cota (m)':avg_cota,
                       'Volume Ãštil (hmÂ³)':avg_volU,'Volume (%)':avg_vol}, ignore_index=True)
        print("Averaged month values added to df_res!")
        print('Data da MediÃ§Ã£o:',data,'Cota (m):',avg_cota,
                       'Volume Ãštil (hmÂ³):',avg_volU,'Volume (%):',avg_vol)
        
        # then we start cummulative values and the counter for the next month
        actual_month = month
        print(month)
        # summing  values for the same month 
        sum_cota += df_corr.iloc[i]['Cota (m)']
        sum_volU += df_corr.iloc[i]['Volume Ãštil (hmÂ³)']
        sum_vol += df_corr.iloc[i]['Volume (%)']
        counter += 1
        actual_month = month
        break

1
MÃªs  04
2
Averaged month values added to df_res!
Data da MediÃ§Ã£o: 2002-05-06 Cota (m): 0.0 Volume Ãštil (hmÂ³): 451.28 Volume (%): 6.74
05